Repository: TFSThiagoBR98/musl-locale
Catalog: musl-po/*.po
Languages: pt_br

source: Error loading shared library %s: %m
pt_br: Erro ao carregar biblioteca compartilhada %s: %m

source: %s: Error getting %zu bytes thread-local storage: %m
pt_br: %s: Erro ao obter %zu bytes do armazenamento de thread-local: %m

source: Library %s is not already loaded
pt_br: Biblioteca %s não está atualmente carregada

source: %s: %s: Not a valid dynamic program
pt_br: %s: %s: Não é um programa dinâmico válido

source: Error loading shared library %s: %m (needed by %s)
pt_br: Erro ao carregar biblioteca compartilhada %s: %m (necessária para %s)

source: Error relocating %s: RELRO protection failed: %m
pt_br: Erro ao realocar %s: proteção RELRO falhou: %m

source: Error allocating function descriptors for %s
pt_br: Erro ao realocar o descritor da função para %s

source: Error relocating %s: unsupported relocation type %d
pt_br: Erro ao realocar %s: tipo de realocação não suportado %d

source: Assertion failed: %s (%s: %s: %d)
pt_br: Assertion falhou: %s (%s: %s: %d)

source: Error relocating %s: %s: symbol not found
pt_br: Erro ao realocar %s: %s: símbolo não encontrado

source: Error relocating %s: cannot allocate TLSDESC for %s
pt_br: Erro ao realocar %s: não é possível alocar TLSDESC para %s

source: Dynamic linker failed to allocate memory for error message
pt_br: O linker dinâmico falhou ao alocar memória para a mensagem de erro

source: Invalid library handle %p
pt_br: Manipulador de biblioteca inválido %p

source: Dynamic loading not supported
pt_br: Carregamento dinâmico não suportado

source: Unsupported request %d
pt_br: Requisição não suportada %d

source: Symbol not found: %s
pt_br: Símbolo não encontrado: %s

source: missing from binmap!
pt_br: não encontrado no mapa binário

source: binmap wrongly contains %d!
pt_br: mapa binário erradamente contém %d!

source: label
pt_br: rótulo

source: severity
pt_br: gravidade

source: text
pt_br: texto

source: action
pt_br: ação

source: tag
pt_br: etiqueta

source: HALT:
pt_br: SUSPENSO:

source: ERROR:
pt_br: ERRO:

source: WARNING:
pt_br: AVISO:

source: : option does not take an argument:
pt_br: : opção não recebe argumento:

source: : option requires an argument:
pt_br: : opcão requer um argumento:

source: : option is ambiguous:
pt_br: : option é ambígua:

source: : unrecognized option:
pt_br: : opção não reconhecida:

source: No error
pt_br: Sem erro

source: Unknown signal
pt_br: Sinal desconhecido

source: Host not found
pt_br: Host não encontrado

source: Invalid flags
pt_br: Flags inválidas

source: Illegal byte sequence
pt_br: Sequência ilegal de bytes

source: Domain error
pt_br: Erro de domínio

source: Result not representable
pt_br: Resultado não representável

source: Not a tty
pt_br: Não é tty

source: Permission denied
pt_br: Permissão negada

source: Operation not permitted
pt_br: Operação não permitida

source: No such file or directory
pt_br: Arquivo ou diretório não encontrado

source: No such process
pt_br: Esse processo não existe

source: File exists
pt_br: Arquivo existe

source: Value too large for data type
pt_br: Valor muito grande para o tipo de dado

source: No space left on device
pt_br: Não há mais espaço no dispositivo

source: Resource busy
pt_br: Recurso ocupado

source: Interrupted system call
pt_br: Chamada de sistema interrompida

source: Resource temporarily unavailable
pt_br: Recurso temporáriamente indisponível

source: Invalid seek
pt_br: Busca(seek) inválido

source: Cross-device link
pt_br: Link entre dispositivos

source: Read-only file system
pt_br: Sistema de arquivos somente leitura

source: Directory not empty
pt_br: Diretório não vazio

source: Connection reset by peer
pt_br: Conexão redefinida pelo peer

source: Operation timed out
pt_br: Operação expirou

source: Connection refused
pt_br: Conexão recusada

source: Host is down
pt_br: Host está indisponível

source: Host is unreachable
pt_br: O host está inacessível

source: Address in use
pt_br: Endereço em uso

source: Broken pipe
pt_br: Pipe quebrado

source: I/O error
pt_br: erro de entrada e saida (I/O)

source: No such device or address
pt_br: Endereço ou dispositivo não existe

source: Block device required
pt_br: Dispositivo Block necessário

source: No such device
pt_br: Dispositivo não existe

source: Not a directory
pt_br: Não é um diretório

source: Is a directory
pt_br: É um diretório

source: Text file busy
pt_br: Arquivo de texto ocupado

source: Exec format error
pt_br: Erro do formato do executável

source: Invalid argument
pt_br: Argumento inválido

source: Argument list too long
pt_br: Lista de argumentos muito longa

source: Symbolic link loop
pt_br: Link simbólico em loop

source: Filename too long
pt_br: Nome de arquivo muito longo

source: Too many open files in system
pt_br: Muitos arquivos abertos no sistema

source: No file descriptors available
pt_br: Nenhum descritor de arquivos disponível

source: Bad file descriptor
pt_br: Descritor de arquivo inválido

source: No child process
pt_br: Nenhum processo inválido

source: Bad address
pt_br: Endereço inválido

source: File too large
pt_br: Arquivo muito grande

source: Too many links
pt_br: Muitos links

source: No locks available
pt_br: Nenhum bloqueio disponível

source: Resource deadlock would occur
pt_br: Um deadlock de recurso pode ocorrer

source: State not recoverable
pt_br: Estado não recuperável

source: Previous owner died
pt_br: Antigo proprietário foi morto

source: Operation canceled
pt_br: Operação cancelada

source: Function not implemented
pt_br: Função não implementada

source: No message of desired type
pt_br: Nenhuma mensagem do tipo disponível

source: Identifier removed
pt_br: Identificador removido

source: Device not a stream
pt_br: Dispositivo não é um fluxo de dados

source: No data available
pt_br: Nenhum dado disponível

source: Device timeout
pt_br: O dispositivo expirou

source: Out of streams resources
pt_br: Falta de recursos de fluxo de dados

source: Link has been severed
pt_br: O link foi danificado

source: Protocol error
pt_br: Erro de protocolo

source: Bad message
pt_br: Mensagem inválida

source: File descriptor in bad state
pt_br: Descritor de arquivo em um estado inválido

source: Not a socket
pt_br: Não é um socket

source: Destination address required
pt_br: Endereço de destino necessário

source: Message too large
pt_br: Mensagem muito grande

source: Protocol wrong type for socket
pt_br: Tipo errado de protocolo para o socket

source: Protocol not available
pt_br: Protocolo não disponível

source: Protocol not supported
pt_br: Protocolo não suportado

source: Socket type not supported
pt_br: Tipo de socket inválido

source: Not supported
pt_br: Não suportado

source: Protocol family not supported
pt_br: Família de protocolos não suportada

source: Address family not supported by protocol
pt_br: Família de protocolos não suportada pelo protocolo

source: Address not available
pt_br: Endereço não disponível

source: Network is down
pt_br: Rede não disponível

source: Network unreachable
pt_br: Rede inacessível

source: Connection reset by network
pt_br: Conexão redefinida pela rede

source: Connection aborted
pt_br: Conexão abortada

source: abday_1
pt_br: Dom

source: abday_2
pt_br: Seg

source: abday_3
pt_br: Ter

source: abday_4
pt_br: Qua

source: abday_5
pt_br: Qui

source: abday_6
pt_br: Sex

source: abday_7
pt_br: Sáb

source: day_1
pt_br: Domingo

source: day_2
pt_br: Segunda

source: day_3
pt_br: Terça

source: day_4
pt_br: Quarta

source: day_5
pt_br: Quinta

source: day_6
pt_br: Sexta

source: day_7
pt_br: Sábado

source: abmon_1
pt_br: Jan

source: abmon_2
pt_br: Feb

source: abmon_3
pt_br: Mar

source: abmon_4
pt_br: Abr

source: abmon_5
pt_br: Mai

source: abmon_6
pt_br: Jun

source: abmon_7
pt_br: Jul

source: abmon_8
pt_br: Ago

source: abmon_9
pt_br: Set

source: abmon_10
pt_br: Out

source: abmon_11
pt_br: Nov

source: abmon_12
pt_br: Dez

source: mon_1
pt_br: January

source: mon_2
pt_br: February

source: mon_3
pt_br: March

source: mon_4
pt_br: April

source: mon_5
pt_br: June

source: mon_6
pt_br: July

source: mon_7
pt_br: August

source: mon_8
pt_br: September

source: mon_9
pt_br: October

source: mon_10
pt_br: November

source: mon_11
pt_br: December

source: am
pt_br: PM

source: d_t_fmt
pt_br: %a %b %e %T %Y

source: d_fmt
pt_br: %m/%d/%y

source: t_fmt
pt_br: %H:%M

source: t_fmt_ampm
pt_br: %I:%M:%S %p

source: era_d_fmt
pt_br: %m/%d/%y

source: era_d_t_fmt
pt_br: %a %b %e %T %Y %Z

source: era_t_fmt
pt_br: %H:%M:%S

source: yesexpr
pt_br: ^[yYSs]

source: noexpr
pt_br: ^[nN]

source: yesstr
pt_br: sim

source: nostr
pt_br: não

source: int_curr_symbol
pt_br: BRL

source: currency_symbol
pt_br: R$

source: Try again
pt_br: Tentar novamente
